#+TITLE: Consumables order/price tracking
#+AUTHOR: Paul Provost
#+EMAIL: paul@bouzou.org
#+DESCRIPTION: 
#+FILETAGS: @redbeardcables:@consumables

* [2015-04-14 Tue] G&H Plugs [[https://032eaf4.netsolstores.com/order-detail.aspx?order%3D65323][Pro Audio Wiring]]

  |------------------------------------------------------------------+--------------+----------+----------------------+-------------+-----------+----------------+---------------------------|
  | Product Name                                                     | Item Number  | Quantity | Item Price           | Total Price | Total CAD | Item price CAD | Item price CAD w/Shipping |
  |------------------------------------------------------------------+--------------+----------+----------------------+-------------+-----------+----------------+---------------------------|
  | G&H Industries BF2P-BNN 1/4" TS Phone Plugs - Black & Nickel     | BF2P-BNN     |       10 | 2.80                 |       28.00 |     36.17 |           3.62 |                      4.57 |
  | G&H Industries BF2P-BNN-375 1/4" TS Phone Plugs - Black & Nicke  | BF2P-BNN-375 |        4 | 2.95                 |       11.80 |     15.24 |           3.81 |                      4.76 |
  | G&H Industries BF3PM-BNNN 1/4" TRS Phone Plugs                   | BF3PM-BNNN   |       10 | 5.00                 |       50.00 |     64.59 |           6.46 |                      7.41 |
  | G&H Industries BF2P-BNN-322 1/4" TS Phone Plugs - Black & Nickel | BF2P-BNN-322 |        4 | 2.95                 |       11.80 |     15.24 |           3.81 |                      4.76 |
  |------------------------------------------------------------------+--------------+----------+----------------------+-------------+-----------+----------------+---------------------------|
  |                                                                  |              |          | Subtotal:            |      101.60 |    131.24 |                |                           |
  |                                                                  |              |          | Shipping & Handling: |       20.55 |     26.55 |           0.95 |                           |
  |                                                                  |              |          | Tax:                 |        0.00 |           |                |                           |
  |                                                                  |              |          | Order Total:         |      122.15 |    157.79 |                |                           |
  |------------------------------------------------------------------+--------------+----------+----------------------+-------------+-----------+----------------+---------------------------|
  #+TBLFM: @2$6..@5$6=$-1*(@9$6/@9$5);%.2f::@2$7..@5$7=$-1/$3;%.2f::@6$6..@7$6=$-1*(@9$6/@9$5);%.2f::@7$7=$-1/vsum(@2$3..@5$3);%.2f::@2$8..@5$8=$-1+@7$7


* [2015-04-14 Tue] CBI Cable Jacks Music Store

  #+NAME:20150414jacks
  |-----------+---------+----------+---------+-----------|
  | Item      | Cost    | Qty.     | Total   | Total CAD |
  |-----------+---------+----------+---------+-----------|
  | CBI BW-GA | 35.35   | 110      | 35.35   | 45.45     |
  | CBI BW-ML | 115.79  | 250      | 115.79  | 148.87    |
  |-----------+---------+----------+---------+-----------|
  |           |         | Subtotal | 151.14  | 194.32    |
  |           |         | Shipping | 76.40   | 98.38     |
  |           |         | Total    | 227.54  | 292.70    |
  |-----------+---------+----------+---------+-----------|

  Prices pre foot

  Shipping

  #+NAME:shipping20150414jacks
  |------------+---------+---------------|
  | Total Cost | Footage | Cost per foot |
  |------------+---------+---------------|
  |      98.38 |     360 |          0.27 |
  |------------+---------+---------------|
  #+TBLFM: @2$2=remote(20150414jacks,@2$3)+remote(20150414jacks,@3$3)::@2$3=$1/$2;%.2f


  |-----------+-----------+------+---------------+---------------|
  | Item      | TotalCost | Feet | Cost per foot | With shipping |
  |-----------+-----------+------+---------------+---------------|
  | CBI BW-GA |     45.45 |  110 |          0.41 |          0.68 |
  | CBI BW-ML |    148.87 |  250 |          0.60 |          0.87 |
  |-----------+-----------+------+---------------+---------------|
  #+TBLFM: $4=$2/$3;%.2f::$5=$4+remote(shipping20150414jacks,@2$3);%.2f

